02_hvacVid/0/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 302;

boundaryField
{
    dinding
    {
        type            fixedValue;
        value           uniform 297;
    }
	
	tembok
	{
		type            zeroGradient;
	}
	
	human
	{
		type			externalWallHeatFluxTemperature;
		mode			power;
		Q				uniform 150;
		kappaMethod		fluidThermo;
		value			uniform 300;
	}
	
	electronics
	{
		type			externalWallHeatFluxTemperature;
		mode			power;
		Q				uniform 300;
		kappaMethod		fluidThermo;
		value			uniform 300;
	}

    inlet
    {
        type            fixedValue;
        value           uniform 289;
    }

    outlet
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
